---
kind: other
id: Methods.T:Autodesk.Revit.DB.CurveArrayIterator
source: html/736a073d-c994-677e-41bf-ec1decdae233.htm
---
# CurveArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.